/*
 * include/asm-arm/arch-omap24xx/display.h
 *
 * Copyright (C) 2004-2005 Texas Instruments.
 * Copyright (C) 2006 Texas Instruments.
 *
 * This file is licensed under the terms of the GNU General Public License
 * version 2. This program is licensed "as is" without any warranty of any
 * kind, whether express or implied.

 * Leveraged from original Linux 2.6 framebuffer driver for OMAP24xx
 * Author: Andy Lowe (source@mvista.com)
 * Copyright (C) 2004 MontaVista Software, Inc.
 *
 */

#ifndef	__ASM_ARCH_OMAP2_DISP_H
#define	__ASM_ARCH_OMAP2_DISP_H

#include <linux/videodev.h>

/*physical memory map definitions */
	/* display subsystem */
#define DSS_REG_BASE			0x48050000
#define DSS_REG_SIZE			0x00001000
	/* DSS */
#define DSS_REG_OFFSET			0x00000000
	/* display controller */
#define DISPC_REG_OFFSET		0x00000400
	/* remote framebuffer interface */
#define RFBI_REG_OFFSET			0x00000800
	/* video encoder */
#define VENC_REG_OFFSET			0x00000C00

/* display subsystem register offsets */
#define DSS_REVISION			0x000
#define DSS_SYSCONFIG			0x010
#define DSS_SYSSTATUS			0x014
#define DSS_IRQSTATUS			0x018
#define DSS_CONTROL			0x040
#ifdef CONFIG_ARCH_OMAP3430
#define DSS_SDI_CONTROL			0x044 /* omap3430 specific */
#define DSS_PLL_CONTROL			0x048 /* omap3430 specific */
#define DSS_SDI_STATUS			0x05C
#endif /* CONFIG_ARCH_OMAP3430 */
#define DSS_PSA_LCD_REG_1		0x050
#define DSS_PSA_LCD_REG_2		0x054
#define DSS_PSA_VIDEO_REG		0x058
#define DSS_STATUS			0x05C


#define VENC_CC_CARR_WSS_CARR			0x0028
#define VENC_C_PHASE				0x002C
#define VENC_GAIN_U				0x0030
#define VENC_GAIN_V				0x0034
#define VENC_GAIN_Y				0x0038
#define VENC_BLACK_LEVEL			0x003C
#define VENC_BLANK_LEVEL			0x0040
#define VENC_X_COLOR				0x0044
#define VENC_M_CONTROL				0x0048
#define VENC_BSTAMP_WSS_DATA			0x004C
#define VENC_S_CARR				0x0050
#define VENC_LINE21				0x0054
#define VENC_LN_SEL				0x0058
#define VENC_L21_WC_CTL				0x005C
#define VENC_HTRIGGER_VTRIGGER			0x0060
#define VENC_SAVID_EAVID			0x0064
#define VENC_FLEN_FAL				0x0068
#define VENC_LAL_PHASE_RESET			0x006C
#define VENC_HS_INT_START_STOP_X		0x0070
#define VENC_HS_EXT_START_STOP_X		0x0074
#define VENC_VS_INT_START_X			0x0078
#define VENC_VS_INT_STOP_X_VS_INT_START_Y	0x007C
#define VENC_VS_INT_STOP_Y_VS_EXT_START_X	0x0080
#define VENC_VS_EXT_STOP_X_VS_EXT_START_Y	0x0084
#define VENC_VS_EXT_STOP_Y			0x0088
#define VENC_AVID_START_STOP_X			0x0090
#define VENC_AVID_START_STOP_Y			0x0094
#define VENC_FID_INT_START_X_FID_INT_START_Y	0x00A0
#define VENC_FID_INT_OFFSET_Y_FID_EXT_START_X	0x00A4
#define VENC_FID_EXT_START_Y_FID_EXT_OFFSET_Y	0x00A8
#define VENC_TVDETGP_INT_START_STOP_X		0x00B0
#define VENC_TVDETGP_INT_START_STOP_Y		0x00B4
#define VENC_GEN_CTRL				0x00B8
#define VENC_DAC_TST				0x00C4
#define VENC_DAC				0x00C8

/* VENC bit fields */
#define VENC_FCONTROL_RESET			(1<<8)

#define VENC_L21_WC_CTL_INV			(1<<15)
#define VENC_L21_WC_CTL_INV_SHIFT	15
#define VENC_L21_WC_CTL_EVEN_ODD_EN		(3<<13)
#define VENC_L21_WC_CTL_EVEN_ODD_EN_SHIFT	13
#define VENC_L21_WC_CTL_LINE		(0x1F<<8)
#define VENC_L21_WC_CTL_LINE_SHIFT	8
#define VENC_L21_WC_CTL_L21EN		(0x3)
#define VENC_L21_WC_CTL_L21EN_SHIFT	 0


#define VENC_BSTAMP_WSS_DATA_WSS_DATA		(0xFFFFF<<8)
#define VENC_BSTAMP_WSS_DATA_WSS_DATA_SHIFT 8
#define VENC_BSTAMP_WSS_DATA_WSS_SQP		(1<<7)
#define VENC_BSTAMP_WSS_DATA_WSS_SQP_SHIFT	7
#define VENC_BSTAMP_WSS_DATA_WSS_BSTAP		(0x7F<<0)
#define VENC_BSTAMP_WSS_DATA_WSS_BSTAP_SHIFT 0

#define VENC_CC_CARR_WSS_CARR_FWSS		(0xFFFF<<16)
#define VENC_CC_CARR_WSS_CARR_FWSS_SHIFT	16
#define VENC_CC_CARR_WSS_CARR_FCC		(0xFFFF<<0)
#define VENC_CC_CARR_WSS_CARR_FCC_SHIFT		0


/* Rotation using VRFB */
#define SMS_ROT_VIRT_BASE(context, degree)	0x70000000 		\
						| 0x4000000 * (context)	\
						| 0x1000000 * (degree/90)
#define SMS_IMAGEHEIGHT_OFFSET			16
#define SMS_IMAGEWIDTH_OFFSET			0
#define SMS_PH_OFFSET				8
#define SMS_PW_OFFSET				4
#define SMS_PS_OFFSET				0

#ifdef CONFIG_ARCH_OMAP2420
#define OMAP_SMS_BASE	(L3_24XX_BASE + 0x8000)
#endif
#ifdef CONFIG_ARCH_OMAP2430
#define OMAP_SMS_BASE	OMAP243X_SMS_PHYS
#endif
#ifdef CONFIG_ARCH_OMAP3430
#define OMAP_SMS_BASE	SMS_PHYS
#endif

#define SMS_ROT0_PHYSICAL_BA(context)	__REG32(OMAP_SMS_BASE + 0x188 \
						+ 0x10 * context)
#define SMS_ROT_CONTROL(context)	__REG32(OMAP_SMS_BASE + 0x180 \
						+ 0x10 * context)
#define SMS_ROT0_SIZE(context)		__REG32(OMAP_SMS_BASE + 0x184 \
						+ 0x10 * context)

/* Structure to store and restore the DSS registers */
struct omap24xx_dispc_regs {
	u32 revision;			/* 0x000 */
	u32 res1[3];
	u32 sysconfig;		/* 0x010 */
	u32 sysstatus;		/* 0x014 */
	u32 irqstatus;		/* 0x018 */
	u32 irqenable;		/* 0x01C */
	u32 res2[8];
	u32 control;			/* 0x040 */
	u32 config;			/* 0x044 */
	u32 capable;			/* 0x048 */
	u32 default_color0;		/* 0x04C */
	u32 default_color1;		/* 0x050 */
	u32 trans_color0;		/* 0x054 */
	u32 trans_color1;		/* 0x058 */
	u32 line_status;		/* 0x05C */
	u32 line_number;		/* 0x060 */
	u32 timing_h;			/* 0x064 */
	u32 timing_v;			/* 0x068 */
	u32 pol_freq;			/* 0x06C */
	u32 divisor;			/* 0x070 */
	u32 res3[1];
	u32 size_dig;			/* 0x078 */
	u32 size_lcd;			/* 0x07C */
	u32 gfx_ba0;			/* 0x080 */
	u32 gfx_ba1;			/* 0x084 */
	u32 gfx_position;		/* 0x088 */
	u32 gfx_size;			/* 0x08C */
	u32 res4[4];
	u32 gfx_attributes;		/* 0x0A0 */
	u32 gfx_fifo_threshold;	/* 0x0A4 */
	u32 gfx_fifo_size;		/* 0x0A8 */
	u32 gfx_row_inc;		/* 0x0AC */
	u32 gfx_pixel_inc;		/* 0x0B0 */
	u32 gfx_window_skip;		/* 0x0B4 */
	u32 gfx_table_ba;		/* 0x0B8 */
	u32 vid1_ba0;			/* 0x0BC */
	u32 vid1_ba1;			/* 0x0C0 */
	u32 vid1_position;		/* 0x0C4 */
	u32 vid1_size;		/* 0x0C8 */
	u32 vid1_attributes;		/* 0x0CC */
	u32 vid1_fifo_threshold;	/* 0x0D0 */
	u32 vid1_fifo_size;		/* 0x0D4 */
	u32 vid1_row_inc;		/* 0x0D8 */
	u32 vid1_pixel_inc;		/* 0x0DC */
	u32 vid1_fir;			/* 0x0E0 */
	u32 vid1_picture_size;	/* 0x0E4 */
	u32 vid1_accu0;		/* 0x0E8 */
	u32 vid1_accu1;		/* 0x0EC */
	u32 vid1_fir_coef_h0;		/* 0x0F0 */
	u32 vid1_fir_coef_hv0;	/* 0x0F4 */
	u32 vid1_fir_coef_h1;		/* 0x0F8 */
	u32 vid1_fir_coef_hv1;	/* 0x0FC */
	u32 vid1_fir_coef_h2;		/* 0x100 */
	u32 vid1_fir_coef_hv2;	/* 0x104 */
	u32 vid1_fir_coef_h3;		/* 0x108 */
	u32 vid1_fir_coef_hv3;	/* 0x10C */
	u32 vid1_fir_coef_h4;		/* 0x110 */
	u32 vid1_fir_coef_hv4;	/* 0x114 */
	u32 vid1_fir_coef_h5;		/* 0x118 */
	u32 vid1_fir_coef_hv5;	/* 0x11C */
	u32 vid1_fir_coef_h6;		/* 0x120 */
	u32 vid1_fir_coef_hv6;	/* 0x124 */
	u32 vid1_fir_coef_h7;		/* 0x128 */
	u32 vid1_fir_coef_hv7;	/* 0x12C */
	u32 vid1_conv_coef0;		/* 0x130 */
	u32 vid1_conv_coef1;		/* 0x134 */
	u32 vid1_conv_coef2;		/* 0x138 */
	u32 vid1_conv_coef3;		/* 0x13C */
	u32 vid1_conv_coef4;		/* 0x140 */
	u32 res5[2];
	u32 vid2_ba0;			/* 0x14C */
	u32 vid2_ba1;			/* 0x150 */
	u32 vid2_position;		/* 0x154 */
	u32 vid2_size;		/* 0x158 */
	u32 vid2_attributes;		/* 0x15C */
	u32 vid2_fifo_threshold;	/* 0x160 */
	u32 vid2_fifo_size;		/* 0x164 */
	u32 vid2_row_inc;		/* 0x168 */
	u32 vid2_pixel_inc;		/* 0x16C */
	u32 vid2_fir;			/* 0x170 */
	u32 vid2_picture_size;	/* 0x174 */
	u32 vid2_accu0;		/* 0x178 */
	u32 vid2_accu1;		/* 0x17C */
	u32 vid2_fir_coef_h0;		/* 0x180 */
	u32 vid2_fir_coef_hv0;	/* 0x184 */
	u32 vid2_fir_coef_h1;		/* 0x188 */
	u32 vid2_fir_coef_hv1;	/* 0x18C */
	u32 vid2_fir_coef_h2;		/* 0x190 */
	u32 vid2_fir_coef_hv2;	/* 0x194 */
	u32 vid2_fir_coef_h3;		/* 0x198 */
	u32 vid2_fir_coef_hv3;	/* 0x19C */
	u32 vid2_fir_coef_h4;		/* 0x1A0 */
	u32 vid2_fir_coef_hv4;	/* 0x1A4 */
	u32 vid2_fir_coef_h5;		/* 0x1A8 */
	u32 vid2_fir_coef_hv5;	/* 0x1AC */
	u32 vid2_fir_coef_h6;		/* 0x1B0 */
	u32 vid2_fir_coef_hv6;	/* 0x1B4 */
	u32 vid2_fir_coef_h7;		/* 0x1B8 */
	u32 vid2_fir_coef_hv7;	/* 0x1BC */
	u32 vid2_conv_coef0;		/* 0x1C0 */
	u32 vid2_conv_coef1;		/* 0x1C4 */
	u32 vid2_conv_coef2;		/* 0x1C8 */
	u32 vid2_conv_coef3;		/* 0x1CC */
	u32 vid2_conv_coef4;		/* 0x1D0 */
	u32 data_cycle1;		/* 0x1D4 */
	u32 data_cycle2;		/* 0x1D8 */
	u32 data_cycle3;		/* 0x1DC */
#ifdef CONFIG_ARCH_OMAP3430
	/* omap3430 specific registers */
	u32 vid1_fir_coef_v0;		/* 0x1E0 */
	u32 vid1_fir_coef_v1;		/* 0x1E4 */
	u32 vid1_fir_coef_v2;		/* 0x1E8 */
	u32 vid1_fir_coef_v3;		/* 0x1EC */
	u32 vid1_fir_coef_v4;		/* 0x1F0 */
	u32 vid1_fir_coef_v5;		/* 0x1F4 */
	u32 vid1_fir_coef_v6;		/* 0x1F8 */
	u32 vid1_fir_coef_v7;		/* 0x1FC */
	u32 vid2_fir_coef_v0;		/* 0x200 */
	u32 vid2_fir_coef_v1;		/* 0x204 */
	u32 vid2_fir_coef_v2;		/* 0x208 */
	u32 vid2_fir_coef_v3;		/* 0x20C */
	u32 vid2_fir_coef_v4;		/* 0x210 */
	u32 vid2_fir_coef_v5;		/* 0x214 */
	u32 vid2_fir_coef_v6;		/* 0x218 */
	u32 vid2_fir_coef_v7;		/* 0x21C */
	u32 cpr_coef_r;			/* 0x220 */
	u32 cpr_coef_g;			/* 0x224 */
	u32 cpr_coef_b;			/* 0x228 */
	u32 gfx_preload;		/* 0x22C */
	u32 vid1_preload;		/* 0x230 */
	u32 vid2_preload;		/* 0x234 */
#endif /* CONFIG_ARCH_OMAP3430 */
};

/* WARN: read-only registers omitted! */
struct omap_dss_regs {
	u32 sysconfig;
	u32 control;
#ifdef CONFIG_ARCH_OMAP3430
	u32 sdi_control;
	u32 pll_control;
#endif
	struct omap24xx_dispc_regs dispc;
};

struct tvlcd_status_t {
	int ltype;
	int output_dev;
	int status;
}; 

/* color space conversion matrices */
const static s16 cc_bt601[3][3] = {
	{298, 409, 0}, {298, -208, -100}, {298, 0, 517}
};
const static s16 cc_bt709[3][3] = {
	{298, 459, 0}, {298, -137, -55}, {298, 0, 541}
};
const static s16 cc_bt601_full[3][3] = {
	{256, 351, 0}, {256, -179, -86}, {256, 0, 443}
};

/*----------- following are exposed values and APIs -------------------------*/

#define OMAP2_GRAPHICS		0
#define OMAP2_VIDEO1		1
#define OMAP2_VIDEO2		2
#define OMAP_DSS_GENERIC	3
#define OMAP_DSS_DISPC_GENERIC	4
#define DSS_CTX_NUMBER		(OMAP_DSS_DISPC_GENERIC + 1)

#define OMAP2_OUTPUT_LCD	4
#define OMAP2_OUTPUT_TV		5

